{
  "extensionName": {
    "message": "Marcadores Duplicados",
    "description": "Name of the extension"
  },
  "extensionDescription": {
    "message": "Mostrar/Eliminar marcadores duplicados o carpetas vacías",
    "description": "Description of the extension"
  },
  "errorNoBookmarks": {
    "message": "Esta versión del navegador carece de la API requerida de marcadores. Marcadores Duplicados y extensiones similares no pueden funcionar sin esa API. Lo siento.",
    "description": "Report that the extension will not work on that browser"
  },
  "warningExpertStrong": {
    "message": "⚠ ",
    "description": "First part of warning to enable expert mode: strong"
  },
  "warningExpertText": {
    "message": "No habilite el modo experto si no se entiende completamente las consecuencias!",
    "description": "Second part of warning to enable expert mode: normal"
  },
  "checkboxRules": {
    "message": "Modo experto: use reglas personalizadas para hacer coincidir marcadores similares o ignorar los marcadores al buscar.",
    "description": "Checkbox text for switching on/off regexp rules"
  },
  "titleCheckboxRules": {
    "message": "Con esta opción, se pueden ignorar los marcadores o se pueden encontrar marcadores similares. Los detalles se especifican en términos de expresiones regulares.",
    "description": "Explain what regular expressions are used for"
  },
  "radioFilter": {
    "message": "Filtro",
    "description": "Radio button for filtering a bookmark. The text should be short"
  },
  "titleRadioFilter": {
    "message": "Los marcadores que coincidan con los criterios serán ignorados.",
    "description": "Explain that by choosing that button the corresponding bookmark will be ignored"
  },
  "radioUrl": {
    "message": "Modificar",
    "description": "Radio button for preprocessing a URL. The text should be short"
  },
  "titleRadioUrl": {
    "message": "Antes de comprobar las direcciones URL para encontrar duplicados de marcador, la dirección URL del juego marcadores se preprocesará de acuerdo con la regla especificada.",
    "description": "Explain that by choosing that button the url of matching bookmarks will be preprocessed"
  },
  "radioOff": {
    "message": "Apagado",
    "description": "Radio button for ignoring the rule. The text should be short"
  },
  "titleRadioOff": {
    "message": "Esta regla no tiene efecto.",
    "description": "Explain that by choosing that button the rule has no effect"
  },
  "ruleName": {
    "message": "El nombre coincide",
    "description": "Input field for matching the name. The text should be short"
  },
  "titleRuleName": {
    "message": "La regla se aplica a un marcador si la ruta del marcador (carpetas + nombre) coincide con la expresión regular. El separador de carpetas es \\0 o \\x00.",
    "description": "Explain that bookmarks whose name matches the regular expression will be selected and that folders names are separated by \\0 or \\x00"
  },
  "ruleNameNegation": {
    "message": "El nombre no coincide",
    "description": "Input field for not matching the name. The text should be short"
  },
  "titleRuleNameNegation": {
    "message": "La regla se aplica a un marcador si la ruta del marcador (carpetas + nombre) no coincide con la expresión regular. El separador de carpetas es \\0 o \\x00.",
    "description": "Explain that bookmarks whose names does not match the regular expression will be selected and that folders names are separated by \\0 or \\x00"
  },
  "ruleUrl": {
    "message": "La URL coincide",
    "description": "Input field for matching the URL. The text should be short"
  },
  "titleRuleUrl": {
    "message": "La regla se aplica a un marcador si su URL coincide con la expresión regular.",
    "description": "Explain that bookmarks whose URL matches the regular expression will be selected"
  },
  "ruleUrlNegation": {
    "message": "La URL no coincide",
    "description": "Input field for matching the URL. The text should be short"
  },
  "titleRuleUrlNegation": {
    "message": "La regla se aplica a un marcador si su URL no coincide con la expresión regular.",
    "description": "Explain that bookmarks whose URL does not match the regular expression will be selected"
  },
  "ruleSearch": {
    "message": "Reemplazo de coincidencias de URL",
    "description": "Input field for the search part of the URL. The text should be short"
  },
  "titleRuleSearch": {
    "message": "Al comparar las URL, las partes que coincidan con la expresión regular serán reemplazadas por el texto posterior.",
    "description": "Explain that the corresponding parts of the URL will be replaced for comparison"
  },
  "ruleReplace": {
    "message": "por",
    "description": "Input field for the replacement text for the regular expression matches. The text should be short"
  },
  "titleRuleReplace": {
    "message": "El texto de reemplazo para la expresión regular coincide. Se pueden usar símbolos como $$& o $$1 para referirse a la coincidencia o un contenido de corchete. Los textos especiales \\L$$& y \\U$$& significan una versión en mayúsculas y minúsculas de las coincidencias, respectivamente. Los textos especiales $$URL, $$NAME y $$TITLE significan la URL original (sin modificar) y el nombre completo / título del marcador (con / sin ruta), respectivamente. The latter three can be preceeded or followed by $$& to prepend or append the original match",
    "description": "Explain that the text will be used as replacement text for the regular expression matches"
  },
  "buttonRuleUp": {
    "message": "⇧",
    "description": "Button for moving a rule up. The text should be short"
  },
  "buttonRuleUpFontWeight": {
    "message": "bolder",
    "description": "font-weight property for buttonRuleUp"
  },
  "titleButtonRuleUp": {
    "message": "La regla se moverá hacia arriba.",
    "description": "Explain that the rule will be moved up"
  },
  "buttonRuleDown": {
    "message": "⇩",
    "description": "Button for moving a rule down. The text should be short"
  },
  "buttonRuleDownFontWeight": {
    "message": "bolder",
    "description": "font-weight property for buttonRuleDown"
  },
  "titleButtonRuleDown": {
    "message": "La regla se moverá hacia abajo.",
    "description": "Explain that the rule will be moved down"
  },
  "buttonRuleSub": {
    "message": "✖",
    "description": "Button for removing a rule. The text should be short"
  },
  "titleButtonRuleSub": {
    "message": "Eliminar esta regla.",
    "description": "Explain that the rule will be removed"
  },
  "buttonRuleAdd": {
    "message": "➕",
    "description": "Button for inserting a new rule. The text should be short"
  },
  "titleButtonRuleAdd": {
    "message": "Intertar una nueva regla.",
    "description": "Explain that a new rule will be inserted"
  },
  "trashFolder": {
    "message": "Duplicado",
    "description": "The name of the trash folder. Should match regExpTrashFolder"
  },
  "regExpTrashFolder": {
    "message": "Duplicado",
    "description": "A regular expression matching trashFolder; symbols like .?\\[]()* should be quoted by \\ or surrounded by []"
  },
  "buttonRulesDefault": {
    "message": "⇐ reglas por defecto",
    "description": "Button for restoring default rules. The text should be short"
  },
  "titleButtonRulesDefault": {
    "message": "Restaurar las reglas que se muestran actualmente por las reglas por defecto.",
    "description": "Explain that current rules will be replaced by default rules"
  },
  "buttonRulesStoreLocal": {
    "message": "⇒ almacenamiento local",
    "description": "Button for putting rules to local storage. The text should be short"
  },
  "titleButtonRulesStoreLocal": {
    "message": "Coloca las reglas actuales en el área de almacenamiento local del navegador, posiblemente reemplazando las reglas almacenadas anteriormente.",
    "description": "Explain that current rules will replace those in the browser's local storage area"
  },
  "buttonRulesRestoreLocal": {
    "message": "⇐ almacenamiento local",
    "description": "Button for restoring rules from local storage. The text should be short"
  },
  "titleButtonRulesRestoreLocal": {
    "message": "Reemplaza las reglas que se muestran actualmente por las del área de almacenamiento local del navegador..",
    "description": "Explain that current rules will be replaced by those from the browser's local storage area"
  },
  "buttonRulesCleanLocal": {
    "message": "✖ almacenamiento local",
    "description": "Button for cleaning local storage. The text should be short"
  },
  "titleButtonRulesCleanLocal": {
    "message": "Se limpiarán las reglas almacenadas dentro del área de almacenamiento local del navegador. Las reglas almacenadas se perderán.",
    "description": "Explain that the browser's local storage area will be cleaned from stored rules"
  },
  "buttonRulesStoreSync": {
    "message": "⇒ almacenamiento sync",
    "description": "Button for putting rules to sync storage. The text should be short"
  },
  "titleButtonRulesStoreSync": {
    "message": "Coloca las reglas actuales en el área de almacenamiento sync del navegador, posiblemente reemplazando las reglas almacenadas anteriormente.",
    "description": "Explain that current rules will replace those in the browser's sync storage area"
  },
  "buttonRulesRestoreSync": {
    "message": "⇐ almacenamiento sync",
    "description": "Button for restoring rules from sync storage. The text should be short"
  },
  "titleButtonRulesRestoreSync": {
    "message": "Reemplaza las reglas que se muestran actualmente por las del área de almacenamiento sync del navegador.",
    "description": "Explain that current rules will be replaced by those from the browser's sync storage area"
  },
  "buttonRulesCleanSync": {
    "message": "✖ almacenamiento sync",
    "description": "Button for cleaning sync storage. The text should be short"
  },
  "titleButtonRulesCleanSync": {
    "message": "Se limpiarán las reglas almacenadas dentro del área de almacenamiento sync del navegador. Las reglas almacenadas se perderán.",
    "description": "Explain that the browser's sync storage area will be cleaned from stored rules"
  },
  "buttonListDupes": {
    "message": "Duplicados",
    "description": "Button for listing dupes"
  },
  "titleButtonListDupes": {
    "message": "(Re)calcule la lista de duplicados de marcadores. Dos marcadores se consideran duplicados si sus URL coinciden. En modo experto, las reglas de preprocesamiento (sustitución) de URL seleccionadas se aplican antes de comparar las URL.",
    "description": "Explain that the list of bookmark dupes will be (re)calculated, and how bookmark dupes are defined"
  },
  "buttonListEmpty": {
    "message": "Carpetas vacías",
    "description": "Button for listing empty folders"
  },
  "titleButtonListEmpty": {
    "message": "(Re)calcule la lisa de varpetas vacías. El resultado, falsamente, puede contener marcadores dinámicos.",
    "description": "Explain that the list of empty folders will be (re)calculated, and that the result might falsely contain live bookmarks"
  },
  "buttonListSingles": {
    "message": "No duplicados",
    "description": "Button for listing all non-dupe bookmarks"
  },
  "titleButtonListSingles": {
    "message": "(Re) calcule la lista de marcadores no duplicados. Dos marcadores se consideran duplicados si sus URL coinciden. En modo experto, las reglas de preprocesamiento (sustitución) de URL seleccionadas se aplican antes de comparar las URL.",
    "description": "Explain that the list of all non-dupe bookmarks will be (re)calculated, and how bookmark dupes are defined"
  },
  "buttonMarkButFirst": {
    "message": "Marcar todos los primeros de cada grupo",
    "description": "Button for marking all but first"
  },
  "titleButtonMarkButFirst": {
    "message": "Además, el primer marcador en cada grupo estará sin marcar.",
    "description": "Explain that additionally the first bookmark in each group will be unmarked"
  },
  "buttonMarkButLast": {
    "message": "Marcar todos los últimos de cada grupo",
    "description": "Button for marking all but last"
  },
  "titleButtonMarkButLast": {
    "message": "Además, el último marcador en cada grupo será desmarcado.",
    "description": "Explain that additionally the last bookmark in each group will be unmarked"
  },
  "buttonMarkButOldest": {
    "message": "Marcar todos los más viejos de cada grupo",
    "description": "Button for marking all but oldest"
  },
  "titleButtonMarkButOldest": {
    "message": "Además, el marcador más antiguo de cada grupo será desmarcado.",
    "description": "Explain that additionally the oldest bookmark in each group will be unmarked"
  },
  "buttonMarkButNewest": {
    "message": "Marcar todos los más nuevos de cada grupo",
    "description": "Button for marking all but newest"
  },
  "titleButtonMarkButNewest": {
    "message": "Además, el marcador más nuevo de cada grupo se desmarcará.",
    "description": "Explain that additionally the newest bookmark in each group will be unmarked"
  },
  "buttonMarkAll": {
    "message": "Marcar todos",
    "description": "Button for marking all"
  },
  "titleButtonMarkAll": {
    "message": "Marcar todos los marcadores.",
    "description": "Explain that all bookmarks will be marked"
  },
  "buttonUnmarkAll": {
    "message": "Desmarcar todos",
    "description": "Button for unmarking all"
  },
  "titleButtonUnmarkAll": {
    "message": "Desmarcar todos los marcadores.",
    "description": "Explain that all bookmarks will be unmarked"
  },
  "optionNonFolder": {
    "message": "-- Seleccione una carpeta para obtener los botones correspondientes para marcar --",
    "description": "Name of the non-folder. It might indicate that buttons for markings appear if another name is selected."
  },
  "optionSameFolder": {
    "message": "-- Carpetas idénticas en el mismo grupo --",
    "description": "Name of a special folder selection: Identical folders in the same group"
  },
  "titleSelectFolder": {
    "message": "Si se selecciona una carpeta, aparecerán los botones correspondientes para el marcado.",
    "description": "Explain that selecting a folder will provide corresponding buttons for marking"
  },
  "buttonMarkFolder": {
    "message": "Marcar todos los de la carpeta seleccionada",
    "description": "Button for marking all of the selected folder"
  },
  "titleButtonMarkFolder": {
    "message": "Seleccionar todos los marcadores de la carpeta seleccionada.",
    "description": "Explain that all bookmarks of selected folder will be marked"
  },
  "buttonUnmarkFolder": {
    "message": "Desmarcar todos de la carpeta seleccionada",
    "description": "Button for unmarking all of selected folder"
  },
  "titleButtonUnmarkFolder": {
    "message": "Desmarcar todos los marcadores de la carpeta seleccionada.",
    "description": "Explain that all bookmarks of selected folder will be unmarked"
  },
  "buttonMarkFolderOther": {
    "message": "Marcar todos, menos los que tengan la carpeta seleccionada",
    "description": "Button for marking all but selected folder in groups with it"
  },
  "titleButtonMarkFolderOther": {
    "message": "Además, los marcadores de la carpeta seleccionada serán desmarcados.",
    "description": "Explain that all bookmarks of selected folder will be unmarked"
  },
  "buttonMarkFolderButFirst": {
    "message": "En grupos con la carpeta seleccionada, marca todos los demás o el primero",
    "description": "Button for unmarking all but selected folder or first in groups with it"
  },
  "titleButtonMarkFolderButFirst": {
    "message": "En grupos con la carpeta seleccionada, marca todos los marcadores de esa carpeta y desmarca todos los demás. Si no hay otros, desmarca el primero.",
    "description": "Explain that in groups with selected folder all bookmarks from that folder will be marked and all others unmarked; if there are no others, the first is unmarked"
  },
  "buttonMarkFolderButLast": {
    "message": "En grupos con la carpeta seleccionada, desmarca todos los demás o el último",
    "description": "Button for unmarking all but selected folder or last in groups with it"
  },
  "titleButtonMarkFolderButLast": {
    "message": "En grupos con la carpeta seleccionada, marca todos los marcadores de esa carpeta y desmarca todos los demás. Si no hay otros, desmarca el último.",
    "description": "Explain that in groups with selected folder all bookmarks from that folder will be marked and all others unmarked; if there are no others, the last is unmarked"
  },
  "buttonMarkFolderButOldest": {
    "message": "En grupos con la carpeta seleccionada, desmarca todos los demás o los más antiguos",
    "description": "Button for unmarking all but selected folder or oldest in groups with it"
  },
  "titleButtonMarkFolderButOldest": {
    "message": "En grupos con la carpeta seleccionada, marca todos los marcadores de esa carpeta y desmarca todos los demás. Si no hay otros, desmarca el más antiguo.",
    "description": "Explain that in groups with selected folder all bookmarks from that folder will be marked and all others unmarked; if there are no others, the oldest is unmarked"
  },
  "buttonMarkFolderButNewest": {
    "message": "En grupos con la carpeta seleccionada, desmarca todos los demás o los más nuevos",
    "description": "Button for unmarking all but selected folder or newest in groups with it"
  },
  "titleButtonMarkFolderButNewest": {
    "message": "En grupos con la carpeta seleccionada, marca todos los marcadores de esa carpeta y desmarca todos los demás. Si no hay otros, desmarca el más nuevo.",
    "description": "Explain that in groups with selected folder all bookmarks from that folder will be marked and all others unmarked; if there are no others, the newest is unmarked"
  },
  "buttonMarkSame": {
    "message": "Marcar todas las carpetas idénticas en el mismo grupo",
    "description": "Button for marking all of the same folders in the same group"
  },
  "titleButtonMarkSame": {
    "message": "Marcar todos los marcadores de carpetas idénticas en el mismo grupo.",
    "description": "Explain that all bookmarks of identical folders in the same group will be marked"
  },
  "buttonUnmarkSame": {
    "message": "Desmarcar todas las carpetas idénticas en el mismo grupo",
    "description": "Button for unmarking all of the same folders in the same group"
  },
  "titleButtonUnmarkSame": {
    "message": "Desmarcar todos los marcadores de carpetas idénticas en el mismo grupo.",
    "description": "Explain that all bookmarks of identical folders in the same group will be unmarked"
  },
  "buttonMarkSameButFirst": {
    "message": "Marcar todo, pero el primero de las carpetas idénticas en un mismo grupo",
    "description": "Button for marking all but the first of identical folders in the same group"
  },
  "titleButtonMarkSameButFirst": {
    "message": "Además, el primero de las carpetas idénticas en el mismo grupo se desmarcará.",
    "description": "Explain that additionally for identical folders in the same group the first will be unmarked"
  },
  "buttonMarkSameButLast": {
    "message": "Marcar todo, pero el último de las carpetas idénticas en un mismo grupo",
    "description": "Button for marking all but the last of identical folders in the same group"
  },
  "titleButtonMarkSameButLast": {
    "message": "Además, el último de las carpetas idénticas en el mismo grupo se desmarcará.",
    "description": "Explain that additionally for identical folders in the same group the last will be unmarked"
  },
  "buttonMarkSameButOldest": {
    "message": "Marcar todo menos el más viejo de carpetas idénticas en el mismo grupo",
    "description": "Button for marking all but the oldest of identical folders in the same group"
  },
  "titleButtonMarkSameButOldest": {
    "message": "Adicionalmente, el más viejo de carpetas idénticas en el mismo grupo se desmarcará.",
    "description": "Explain that additionally for identical folders in the same group the oldest will be unmarked"
  },
  "buttonMarkSameButNewest": {
    "message": "Marcar todo menos el más nuevo de carpetas idénticas en el mismo grupo",
    "description": "Button for marking all but the newest of identical folders in the same group"
  },
  "titleButtonMarkSameButNewest": {
    "message": "Adicionalmente, el más nuevo de carpetas idénticas en el mismo grupo se desmarcará.",
    "description": "Explain that additionally for identical folders in the same group the newest will be unmarked"
  },
  "warningRemoveMarked": {
    "message": "⚠",
    "description": "Text in front of button for removing marked bookmarks"
  },
  "buttonRemoveMarked": {
    "message": "Eliminar marcadores marcados",
    "description": "Button for removing marked bookmarks"
  },
  "titleButtonRemoveMarked": {
    "message": "Los marcadores marcados se refieren a los obtenidos la última vez que se pulsó el botón para obtener la lista.",
    "description": "Explain that bookmarks refer to those of last update of the list"
  },
  "buttonMoveMarked": {
    "message": "Mover los marcadores marcados a “{0}”",
    "description": "Button for moving marked bookmarks to trash folder. The trash folder name in the text should be {0}"
  },
  "buttonStopRemoving": {
    "message": "Parar de eliminar!",
    "description": "Button for emergency stop of bookmark removing"
  },
  "buttonStopMoving": {
    "message": "Parar me mover!",
    "description": "Button for emergency stop of bookmark moving"
  },
  "checkboxFullUrl": {
    "message": "Mostrar URL en el listado. En cualquier caso, la URL aparecerá si pasa el puntero sobre el marcador.",
    "description": "Checkbox for displaying URL in listing. Explain that the URL will appear as title anyway"
  },
  "checkboxExtra": {
    "message": "Mostrar contenido de URL reemplazado en la lista",
    "description": "Checkbox for displaying the replaced URL content in listing"
  },
  "messageCount": {
    "message": "$TOTAL$ marcadores marcados",
    "description": "Report specified number of marked bookmarks",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "messageNoCount": {
    "message": "El número de marcadores seleccionados no mostrado por razones de velocidad",
    "description": "Report that marks are not counted for speed reasons"
  },
  "messageMatches": {
    "message": "$TOTAL$ duplicados (of $ALL$ marcadores) en $GROUPS$ grupos",
    "description": "Report specified numbers of matches and groups of all",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "2"
      },
      "groups": {
        "content": "$2",
        "example": "1"
      },
      "all": {
        "content": "$3",
        "example": "1"
      }
    }
  },
  "titleMessageMatches": {
    "message": "Dos marcadores se consideran duplicados si sus URL coinciden. En modo experto, las reglas de preprocesamiento (sustitución) de URL seleccionadas se aplican antes de comparar las URL.",
    "description": "Explain how bookmark dupes are defined"
  },
  "messageEmpty": {
    "message": "$TOTAL$ carpetas vacías encontradas",
    "description": "Report specified number of empty folders",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "titleMessageEmpty": {
    "message": "La lista puede contener falsamente marcadores vivos.",
    "description": "Explain that the list might falsely contain live bookmarks"
  },
  "messageSingles": {
    "message": "$TOTAL$ marcadores no duplicados (de $ALL$ marcadores) encontrados",
    "description": "Report specified number of non-dupe bookmarks",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      },
      "all": {
        "content": "$2",
        "example": "1"
      }
    }
  },
  "titleMessageSingles": {
    "message": "Lista de no duplicados",
    "description": "Explain that list of non-dupe bookmarks is shown"
  },
  "messageCalculating": {
    "message": "Buscando",
    "description": "Report that calculation started"
  },
  "messageCalculateError": {
    "message": "Error: $ERROR$",
    "description": "Report specified error during calculation",
    "placeholders": {
      "error": {
        "content": "$1",
        "example": "error description"
      }
    }
  },
  "messageRemoveMarked": {
    "message": "Eliminando marcadores marcados",
    "description": "Report that removal of marked bookmarks started"
  },
  "messageRemoveProgress": {
    "message": "($PERCENTAGE$ %) $TOTAL$ de $TODO$ marcadores borrados",
    "description": "Report that specified number/total/percentage of bookmarks are removed",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      },
      "todo": {
        "content": "$2",
        "example": "1"
      },
      "percentage": {
        "content": "$3",
        "example": "0"
      }
    }
  },
  "messageRemoveSuccess": {
    "message": "$TOTAL$ marcadores borrados!",
    "description": "Report success when removing specified number of bookmarks",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "messageRemoveError": {
    "message": "Error después de eliminar $TOTAL$ marcadores: $ERROR$",
    "description": "Report specified error after removing specified number of bookmarks",
    "placeholders": {
      "error": {
        "content": "$1",
        "example": "error description"
      },
      "total": {
        "content": "$2",
        "example": "0"
      }
    }
  },
  "messageMoveMarked": {
    "message": "Moviendo marcadores marcados",
    "description": "Report that moving of marked bookmarks started"
  },
  "messageMoveProgress": {
    "message": "($PERCENTAGE$ %) $TOTAL$ de $TODO$ marcadores movidos",
    "description": "Report that specified number/total/percentage of bookmarks are moved",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      },
      "todo": {
        "content": "$2",
        "example": "1"
      },
      "percentage": {
        "content": "$3",
        "example": "0"
      }
    }
  },
  "messageMoveSuccess": {
    "message": "$TOTAL$ marcadores movidos!",
    "description": "Report success when moving specified number of bookmarks",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "messageMoveError": {
    "message": "Error despues de mover $TOTAL$ marcadores: $ERROR$",
    "description": "Report specified error after moving specified number of bookmarks",
    "placeholders": {
      "error": {
        "content": "$1",
        "example": "error description"
      },
      "total": {
        "content": "$2",
        "example": "0"
      }
    }
  },
  "errorNoBookmarkFolderFound": {
    "message": "No se ha encontrado la carpeta de marcadores",
    "description": "Report that no bookmark folder was found"
  }
}
