{
  "extensionName": {
    "message": "Lesezeichenduplikate",
    "description": "Name of the extension"
  },
  "extensionDescription": {
    "message": "Anzeige/Entfernung doppelter Lesezeichen, leerer Ordner oder Beschreibungen",
    "description": "Description of the extension"
  },
  "checkboxRules": {
    "message": "Experten-Modus: anpassbare Regeln zum Finden ähnlicher Lesezeichen oder Ignorieren von Lesezeichen",
    "description": "Checkbox text for switching on/off regexp rules"
  },
  "titleCheckboxRules": {
    "message": "Mit dieser Option können Lesezeichen ignoriert oder ähnliche Lesezeichen gefunden werde. Die Details werden mit Hilfe regulärer Ausdrücke festgelegt.",
    "description": "Explain what regular expresssions are used for"
  },
  "radioFilter": {
    "message": "Ignorieren",
    "description": "Radio button for filtering a bookmark. The text should be short"
  },
  "titleRadioFilter": {
    "message": "Lesezeichen ignorieren, die auf die Kriterien passen",
    "description": "Explain that by choosing that button the corresponding bookmark will be ignored"
  },
  "radioUrl": {
    "message": "Modifizieren",
    "description": "Radio button for preprocessing a URL. The text should be short"
  },
  "titleRadioUrl": {
    "message": "Vor der Überprüfung von URLs zum Feststellen von Lesezeichenduplikaten wird die URL passender Lesezeichen entsprechend der Regel modifiziert.",
    "description": "Explain that by choosing that button the url of matching bookmarks will be preprocessed"
  },
  "radioOff": {
    "message": "Aus",
    "description": "Radio button for ignoring the rule. The text should be short"
  },
  "titleRadioOff": {
    "message": "Diese Regel hat keine Auswirkungen.",
    "description": "Explain that by choosing that button the rule has no effect"
  },
  "ruleName": {
    "message": "Name passt",
    "description": "Input field for matching the name. The text should be short"
  },
  "titleRuleName": {
    "message": "Die Regel trifft auf ein Lesezeichen zu, wenn dessen Pfad (Ordner + Name) auf den regulären Ausdruck passt. Der Trenner für Ordner ist \\0 oder \\x00.",
    "description": "Explain that bookmarks whose name matches the regular expression will be selected and that folders names are separated by \\0 or \\x00"
  },
  "ruleNameNegation": {
    "message": "Name passt nicht",
    "description": "Input field for not matching the name. The text should be short"
  },
  "titleRuleNameNegation": {
    "message": "Die Regel trifft auf ein Lesezeichen zu, wenn dessen Pfad (Ordner + Name) auf den regulären Ausdruck passt. Der Trenner für Ordner ist \\0 oder \\x00.",
    "description": "Explain that bookmarks whose names does not match the regular expression will be selected and that folders names are separated by \\0 or \\x00"
  },
  "ruleUrl": {
    "message": "URL passt",
    "description": "Input field for matching the URL. The text should be short"
  },
  "titleRuleUrl": {
    "message": "Die Regel trifft auf ein Lesezeichen zu, wenn dessen URL (Protokoll und Domainname kleingeschrieben) auf den regulären Ausdruck passt.",
    "description": "Explain that bookmarks whose URL matches the regular expression"
  },
  "ruleUrlNegation": {
    "message": "URL passt nicht",
    "description": "Input field for matching the URL. The text should be short"
  },
  "titleRuleUrlNegation": {
    "message": "Die Regel trifft auf ein Lesezeichen zu, wenn dessen URL (Protokoll und Domainname kleingeschrieben) nicht auf den regulären Ausdruck passt.",
    "description": "Explain that bookmarks whose URL does not match the regular expression"
  },
  "ruleSearch": {
    "message": "Ersetze URL-Teil",
    "description": "Input field for the search part of the URL. The text should be short"
  },
  "titleRuleSearch": {
    "message": "Beim Vergleich von URLs (Protokoll und Domainname kleingeschrieben) werden die Teile, die auf den regulären Ausdruck passen durch den nachfolgenden Text ersetzt.",
    "description": "Explain that the corresponding parts of the URL will be replaced for comparison"
  },
  "ruleReplace": {
    "message": "durch",
    "description": "Input field for the replacement text for the regular expression matches. The text should be short"
  },
  "titleRuleReplace": {
    "message": "Der Ersetzungstext für den passenden Teil des regulären Ausdrucks",
    "description": "Explain that the text will be used as replacement text for the regular expression matches"
  },
  "buttonRuleAdd": {
    "message": "Neu",
    "description": "Button for inserting a new rule. The text should be short"
  },
  "titleButtonRuleAdd": {
    "message": "Einfügen einer neuen Regel.",
    "description": "Explain that a new rule will be inserted"
  },
  "buttonRuleSub": {
    "message": "Löschen",
    "description": "Button for removing a rule. The text should be short"
  },
  "titleButtonRuleSub": {
    "message": "Löschen dieser Regel.",
    "description": "Explain that the rule will be removed"
  },
  "regExpFrequent": {
    "message": "[hH]äufig.*|[oO]ft|[dD]uplikate",
    "description": "A regular expression for folder names which intentionally might contain duplicate bookmarks (e.g. \"Frequently used\"). The expression is enclosed into \\0(...)\\0"
  },
  "buttonListDupes": {
    "message": "Lesezeichenduplikate",
    "description": "Button for listing dupes"
  },
  "titleButtonListDupes": {
    "message": "Berechne (erneut) die Liste der Lesezeichenduplikate. Zwei Lesezeichen gelten als exakte Duplikate, wenn ihre URL identisch ist.",
    "description": "Explain that the list of bookmark dupes will be (re)calculated, and how bookmark dupes are defined"
  },
  "buttonListEmpty": {
    "message": "Leere Ordner",
    "description": "Button for listing empty folders"
  },
  "titleButtonListEmpty": {
    "message": "Berechne (erneut) die Liste leerer Ordner. Das Ergebnis kann fälschlicherweise auch Live-Lesezeichen enthalten.",
    "description": "Explain that the list of empty folders will be (re)calculated, and that the result might falsely contain live bookmarks"
  },
  "buttonListAll": {
    "message": "Alle Lesezeichen",
    "description": "Button for listing all bookmarks"
  },
  "titleButtonListAll": {
    "message": "Berechne (erneut) die Liste aller Lesezeichen zum Entfernen von Beschreibungen. Die Liste besteht aus allen Lesezeichen mit einer nichtleeren URL.",
    "description": "Explain that the list of all bookmarks will be (re)calculated for stripping descriptions and that it consists of those bookmarks with a nonempty URL"
  },
  "buttonMarkButFirst": {
    "message": "Alle außer Gruppenersten markieren",
    "description": "Button for marking all but first"
  },
  "titleButtonMarkButFirst": {
    "message": "Zusätzlich wird die Markierung des ersten Lesezeichens jeder Gruppe entfernt.",
    "description": "Explain that additionally the first bookmark in each group will be unmarked"
  },
  "buttonMarkButLast": {
    "message": "Alle außer Gruppenletzten markieren",
    "description": "Button for marking all but last"
  },
  "titleButtonMarkButLast": {
    "message": "Zusätzlich wird die Markierung des letzten Lesezeichens jeder Gruppe entfernt.",
    "description": "Explain that additionally the last bookmark in each group will be unmarked"
  },
  "buttonMarkButOldest": {
    "message": "Alle außer Gruppenältesten markieren",
    "description": "Button for marking all but oldest"
  },
  "titleButtonMarkButOldest": {
    "message": "Zusätzlich wird die Markierung des ältesten Lesezeichens jeder Gruppe entfernt.",
    "description": "Explain that additionally the oldest bookmark in each group will be unmarked"
  },
  "buttonMarkButNewest": {
    "message": "Alle außer Grupenjüngsten markieren",
    "description": "Button for marking all but newest"
  },
  "titleButtonMarkButNewest": {
    "message": "Zusätzlich wird die Markierung des jüngsten Lesezeichens jeder Gruppe entfernt.",
    "description": "Explain that additionally the newest bookmark in each group will be unmarked"
  },
  "buttonMarkAll": {
    "message": "Alle markieren",
    "description": "Button for marking all"
  },
  "titleButtonMarkAll": {
    "message": "Markiert alle Lesezeichen.",
    "description": "Explain that all bookmarks will be marked"
  },
  "buttonUnmarkAll": {
    "message": "Alle Markierungen entfernen",
    "description": "Button for unmarking all"
  },
  "titleButtonUnmarkAll": {
    "message": "Entfernt Markierungen von allen Lesezeichen.",
    "description": "Explain that all bookmarks will be unmarked"
  },
  "optionNonFolder": {
    "message": "-- Ordnerwahl für zugehörige Markierungsknöpfe --",
    "description": "Name of the non-folder. It might indicate that buttons for markings appear if another name is selected."
  },
  "optionSameFolder": {
    "message": "-- Identische Ordner in der gleichen Gruppe --",
    "description": "Name of a special folder selection: Identical folders in the same group"
  },
  "titleSelectFolder": {
    "message": "Bei Auswahl eines Ordner erscheinen entsprechende Knöpfe zur Markierung.",
    "description": "Explain that selecting a folder will provide corresponding buttons for marking"
  },
  "buttonMarkFolder": {
    "message": "Alle aus dem ausgewählten Ordner markieren",
    "description": "Button for marking all of the selected folder"
  },
  "titleButtonMarkFolder": {
    "message": "Alle Lesezeichen aus dem ausgewählten Ordner werden markiert.",
    "description": "Explain that all bookmarks of selected folder will be marked"
  },
  "buttonUnmarkFolder": {
    "message": "Alle Markierungen vom ausgewählten Ordner entfernen",
    "description": "Button for unmarking all of selected folder"
  },
  "titleButtonUnmarkFolder": {
    "message": "Alle Markierungen von Lesezeichen aus dem ausgewählten Ordner werden entfernt.",
    "description": "Explain that all bookmarks of selected folder will be unmarked"
  },
  "buttonMarkFolderOther": {
    "message": "In Gruppen mit ausgewähltem Ordner alle außer diesem markieren",
    "description": "Button for marking all but selected folder in groups with it"
  },
  "titleButtonMarkFolderOther": {
    "message": "Zusätzlich werden die Lesezeichen aus dem ausgewählten Ordner entfernt.",
    "description": "Explain that all bookmarks of selected folder will be unmarked"
  },
  "buttonMarkFolderButFirst": {
    "message": "In Gruppen mit ausgewähltem Ordner alle außer diesen oder ersten markieren",
    "description": "Button for unmarking all but selected folder or first in groups with it"
  },
  "titleButtonMarkFolderButFirst": {
    "message": "In Gruppen mit dem ausgewählten Ordner werden alle Lesezeichen aus diese Ordner markiert und die Markierungen anderer Lesezeichen entfernt; wenn es keine anderen gibt, wird die Markierung des ersten Lesezeichens der Gruppe entfernt.",
    "description": "Explain that in groups with selected folder all bookmarks from that folder will be marked and all others unmarked; if there are no others, the first is unmarked"
  },
  "buttonMarkFolderButLast": {
    "message": "In Gruppen mit ausgewähltem Ordner alle außer diesen oder letzten markieren",
    "description": "Button for unmarking all but selected folder or last in groups with it"
  },
  "titleButtonMarkFolderButLast": {
    "message": "In Gruppen mit dem ausgewählten Ordner werden alle Lesezeichen aus diese Ordner markiert und die Markierungen anderer Lesezeichen entfernt; wenn es keine anderen gibt, wird die Markierung des letzten Lesezeichens der Gruppe entfernt.",
    "description": "Explain that in groups with selected folder all bookmarks from that folder will be marked and all others unmarked; if there are no others, the last is unmarked"
  },
  "buttonMarkFolderButOldest": {
    "message": "In Gruppen mit ausgewähltem Ordner alle außer diesen oder ältesten markieren",
    "description": "Button for unmarking all but selected folder or oldest in groups with it"
  },
  "titleButtonMarkFolderButOldest": {
    "message": "In Gruppen mit dem ausgewählten Ordner werden alle Lesezeichen aus diese Ordner markiert und die Markierungen anderer Lesezeichen entfernt; wenn es keine anderen gibt, wird die Markierung des ältesten Lesezeichens der Gruppe entfernt.",
    "description": "Explain that in groups with selected folder all bookmarks from that folder will be marked and all others unmarked; if there are no others, the oldest is unmarked"
  },
  "buttonMarkFolderButNewest": {
    "message": "In Gruppen mit ausgewähltem Ordner alle außer diesen oder jüngsten markieren",
    "description": "Button for unmarking all but selected folder or newest in groups with it"
  },
  "titleButtonMarkFolderButNewest": {
    "message": "In Gruppen mit dem ausgewählten Ordner werden alle Lesezeichen aus diese Ordner markiert und die Markierungen anderer Lesezeichen entfernt; wenn es keine anderen gibt, wird die Markierung des jüngesten Lesezeichens der Gruppe entfernt.",
    "description": "Explain that in groups with selected folder all bookmarks from that folder will be marked and all others unmarked; if there are no others, the newest is unmarked"
  },
  "buttonMarkSame": {
    "message": "Markiere alle mit identischen Ordnern aus gleicher Gruppe",
    "description": "Button for marking all of the same folders in the same group"
  },
  "titleButtonMarkSame": {
    "message": "Alle Lesezeichen mit identischen Ordnern aus der gleichen Gruppe werden markiert.",
    "description": "Explain that all bookmarks of identical folders in the same group will be marked"
  },
  "buttonUnmarkSame": {
    "message": "Lösche Markierungen für identische Ordner aus gleicher Gruppe",
    "description": "Button for unmarking all of the same folders in the same group"
  },
  "titleButtonUnmarkSame": {
    "message": "Die Markierungen aller Lesezeichen mit identischen Ordnern aus der gleichen Gruppe werden entfernt.",
    "description": "Explain that all bookmarks of identical folders in the same group will be unmarked"
  },
  "buttonMarkSameButFirst": {
    "message": "Markiere alle außer ersten von identischen Ordnern aus gleicher Gruppe",
    "description": "Button for marking all but the first of identical folders in the same group"
  },
  "titleButtonMarkSameButFirst": {
    "message": "Zusätzlich wird die Markierung des jeweils ersten Lesezeichens von identischen Ordnern aus der gleichen Gruppe entfernt.",
    "description": "Explain that additionally for identical folders in the same group the first will be unmarked"
  },
  "buttonMarkSameButLast": {
    "message": "Markiere alle außer letzten von identischen Ordnern aus gleicher Gruppe",
    "description": "Button for marking all but the last of identical folders in the same group"
  },
  "titleButtonMarkSameButLast": {
    "message": "Zusätzlich wird die Markierung des jeweils letzten Lesezeichens von identischen Ordnern aus der gleichen Gruppe entfernt.",
    "description": "Explain that additionally for identical folders in the same group the last will be unmarked"
  },
  "buttonMarkSameButOldest": {
    "message": "Markiere alle außer ältesten von identischen Ordnern aus gleicher Gruppe",
    "description": "Button for marking all but the oldest of identical folders in the same group"
  },
  "titleButtonMarkSameButOldest": {
    "message": "Zusätzlich wird die Markierung des jeweils ältesten Lesezeichens von identischen Ordnern aus der gleichen Gruppe entfernt.",
    "description": "Explain that additionally for identical folders in the same group the oldest will be unmarked"
  },
  "buttonMarkSameButNewest": {
    "message": "Markiere alle außer neuesten von identischen Ordnern aus gleicher Gruppe",
    "description": "Button for marking all but the newest of identical folders in the same group"
  },
  "titleButtonMarkSameButNewest": {
    "message": "Zusätzlich wird die Markierung des jeweils neuesten Lesezeichens von identischen Ordnern aus der gleichen Gruppe entfernt.",
    "description": "Explain that additionally for identical folders in the same group the newest will be unmarked"
  },
  "buttonRemoveMarked": {
    "message": "Markierte Lesezeichen löschen",
    "description": "Button for removing marked bookmarks"
  },
  "titleButtonRemoveMarked": {
    "message": "Markierte Lesezeichen beziehen sich auf diejenigen seit dem letzten Drücken des Knopfes zur Berechnung der Liste.",
    "description": "Explain that bookmarks refer to those of last update of the list"
  },
  "buttonStripMarked": {
    "message": "Beschreibungen markierter Lesezeichen entfernen",
    "description": "Button for stripping descriptions of marked bookmarks"
  },
  "titleButtonStripMarked": {
    "message": "Entfernung von Beschreibungen aktualisiert das intern gespeicherte Erzeugungsdatum des Lesezeichens. Außerdem verschiebt es das Lesezeichen an die Stelle, an der es beim Drücken des Knopfes zur Berechnung dieser Liste war.",
    "description": "Explain the side effects that stripping updates the date of bookmarks and moves them to the location of the last calculation of the list"
  },
  "buttonStopRemoving": {
    "message": "Löschen abbrechen!",
    "description": "Button for emergency stop of bookmark removing"
  },
  "buttonStopStripping": {
    "message": "Entfernen abbrechen!",
    "description": "Button for emergency stop of description stripping"
  },
  "checkboxFullUrl": {
    "message": "URL anzeigen. Die URL wird in jedem Fall sichtbar, wenn die Maus über dem Lesezeichen steht.",
    "description": "Checkbox for displaying URL in listing. Explain that the URL will appear as title anyway"
  },
  "checkboxExtra": {
    "message": "Ersetzte URL-Teile im Listing anzeigen",
    "description": "Checkbox for displaying the replaced URL content in listing"
  },
  "messageCount": {
    "message": "$TOTAL$ Lesezeichen markiert",
    "description": "Report specified number of marked bookmarks",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "messageNoCount": {
    "message": "Die Anzahl markierter Lesezeichen wird aus Geschwindigkeitsgründen nicht angezeigt.",
    "description": "Report that marks are not counted for speed reasons"
  },
  "messageMatches": {
    "message": "$TOTAL$ (von $ALL$) Duplikate in $GROUPS$ Gruppen",
    "description": "Report specified numbers of matches and groups of all",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "2"
      },
      "groups": {
        "content": "$2",
        "example": "1"
      },
      "all": {
        "content": "$3",
        "example": "1"
      }
    }
  },
  "titleMessageMatches": {
    "message": "Zwei Lesezeichen werden als Duplikate betrachtet, wenn ihre URL übereinstimmt. Für den Vergleich der URLs werden Protokoll und Domainname kleingeschrieben und die anpassbaren Ersetzungsregeln angewandt.",
    "description": "Explain how bookmark dupes are defined"
  },
  "messageEmpty": {
    "message": "$TOTAL$ leere Ordner gefunden",
    "description": "Report specified number of empty folders",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "titleMessageEmpty": {
    "message": "Die Liste kann fälschlicherweise auch Live-Lesezeichen enthalten.",
    "description": "Explain that the list might falsely contain live bookmarks"
  },
  "messageAll": {
    "message": "$TOTAL$ Lesezeichen gefunden",
    "description": "Report specified number of bookmarks",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "titleMessageAll": {
    "message": "Die Liste besteht aus allen Lesezeichen mit einer nichtleeren URL.",
    "description": "Explain that the list consists of those bookmarks with a nonempty URL"
  },
  "messageCalculating": {
    "message": "Suche",
    "description": "Report that calculation started"
  },
  "messageCalculateError": {
    "message": "Fehler: $ERROR$",
    "description": "Report specified error during calculation",
    "placeholders": {
      "error": {
        "content": "$1",
        "example": "Fehlerbeschreibung"
      }
    }
  },
  "messageRemoveMarked": {
    "message": "Markierte Lesezeichen werden gelöscht.",
    "description": "Report that removal of marked bookmarks started"
  },
  "messageRemoveProgress": {
    "message": "($PERCENTAGE$ %) $TOTAL$ von $TODO$ Lesezeichen entfernt",
    "description": "Report that specified number/total/percentage of bookmarks are removed",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      },
      "todo": {
        "content": "$2",
        "example": "1"
      },
      "percentage": {
        "content": "$3",
        "example": "0"
      }
    }
  },
  "messageRemoveSuccess": {
    "message": "$TOTAL$ Lesezeichen gelöscht!",
    "description": "Report success when removing specified number of bookmarks",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "messageRemoveError": {
    "message": "Fehler nach Löschen von $TOTAL$ Lesezeichen: $ERROR$",
    "description": "Report specified error after removing specified number of bookmarks",
    "placeholders": {
      "error": {
        "content": "$1",
        "example": "Fehlerbeschreibung"
      },
      "total": {
        "content": "$2",
        "example": "0"
      }
    }
  },
  "messageStripMarked": {
    "message": "Beschreibungen markierter Lesezeichen werden entfernt.",
    "description": "Report that description stripping started"
  },
  "messageStripProgress": {
    "message": "($PERCENTAGE$ %) $TOTAL$ von $TODO$ Beschreibungen entfernt",
    "description": "Report that specified number/total/percentage of descriptions are stripped",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      },
      "todo": {
        "content": "$2",
        "example": "1"
      },
      "percentage": {
        "content": "$3",
        "example": "0"
      }
    }
  },
  "messageStripSuccess": {
    "message": "$TOTAL$ Beschreibungen entfernt!",
    "description": "Report success when stripping specified number of descriptions",
    "placeholders": {
      "total": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "messageStripError": {
    "message": "Fehler nach Entfernen von $TOTAL$ Beschreibungen: $ERROR$",
    "description": "Report specified error after stripping specified number of descriptions",
    "placeholders": {
      "error": {
        "content": "$1",
        "example": "Fehlerbeschreibung"
      },
      "total": {
        "content": "$2",
        "example": "0"
      }
    }
  }
}
